In [1]:
!pip3 install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\hp\anaconda3\lib\site-packages (9.0.0)

In [3]:
#importing libraries
import pandas as pd
import mysql.connector
import numpy as np

In [5]:
# csv to dataframe
df_buses_1=pd.read_csv(r"C:\Users\HP\Desktop\red bus\df_buses_1.csv")
df_buses_2=pd.read_csv(r"C:\Users\HP\Desktop\red bus\df_buses_2.csv")
df_buses_3=pd.read_csv(r"C:\Users\HP\Desktop\red bus\df_buses_3.csv")
df_buses_4=pd.read_csv(r"C:\Users\HP\Desktop\red bus\df_buses_4.csv")
df_buses_5=pd.read_csv(r"C:\Users\HP\Desktop\red bus\df_buses_as.csv")
df_buses_6=pd.read_csv(r"C:\Users\HP\Desktop\red bus\df_buses_h.csv")
df_buses_7=pd.read_csv(r"C:\Users\HP\Desktop\red bus\df_buses_r.csv")
df_buses_8=pd.read_csv(r"C:\Users\HP\Desktop\red bus\df_buses_SB.csv")
df_buses_9=pd.read_csv(r"C:\Users\HP\Desktop\red bus\df_buses_9.csv")
df_buses_10=pd.read_csv(r"C:\Users\HP\Desktop\red bus\df_buses_10.csv")

Final_df=pd.concat([df_buses_1,df_buses_2,df_buses_3,df_buses_4,df_buses_5,df_buses_6,
                    df_buses_7,df_buses_8,df_buses_9,df_buses_10],ignore_index=True)
Final_df

,Bus_name,Bus_type,Start_time,End_time,Total_duration,Price,Seats_Available,Ratings,Route_link,Route_name
0,MMK Travels,A/C Seater / Sleeper (2+1),22:30,07:30,09h 00m,INR 750,18 Seats available,4.4\n546,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
1,MMK Travels,A/C Sleeper (2+1),23:00,07:30,08h 30m,INR 900,18 Seats available,4.1\n22,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
2,NS Transports,Non A/C Seater / Sleeper (2+1),21:45,06:10,08h 25m,693,16 Seats available,4.1\n281,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
3,AdSAAM BUS,VE A/C Sleeper (2+1),21:45,06:45,09h 00m,INR 900,13 Seats available,4.3\n213,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
4,NS Transports,VE A/C Sleeper (2+1),22:45,07:30,08h 45m,924,22 Seats available,4.0\n301,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
...,...,...,...,...,...,...,...,...,...,...
2212,Satadal Travels,A/C Seater (2+2),15:35,18:15,02h 40m,167,21 Seats available,3.5\n87,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
2213,Swapna Paribahan,Non AC Seater (2+3),16:55,21:25,04h 30m,INR 145,20 Seats available,New,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
2214,Droupadi Bus Service,Non AC Seater (2+3),16:20,19:10,02h 50m,INR 121,52 Seats available,2.2\n22,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
2215,WBTC (CTC) Habra-Midnapur - 194|15:40,Non AC Seater (2+3),15:40,18:40,03h 00m,INR 111,35 Seats available,3.8\n22,https://www.redbus.in/bus-tickets/midnapore-to...,Midnapore to Kolkata Airport
2216,WBTC (CTC) Barasat-Midnapur - 208|17:00,Non AC Seater (2+3),17:00,19:00,02h 00m,INR 111,41 Seats available,3.9,https://www.redbus.in/bus-tickets/midnapore-to...,Midnapore to Kolkata Airport

In [ ]:
DATA CLEANING

In [7]:
# data about the data
Final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2217 entries, 0 to 2216
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         2082 non-null   object
 1   Bus_type         2057 non-null   object
 2   Start_time       2082 non-null   object
 3   End_time         2082 non-null   object
 4   Total_duration   2082 non-null   object
 5   Price            2079 non-null   object
 6   Seats_Available  2075 non-null   object
 7   Ratings          2080 non-null   object
 8   Route_link       2217 non-null   object
 9   Route_name       2217 non-null   object
dtypes: object(10)
memory usage: 173.3+ KB

In [9]:
#convert prices to numeric
Final_df["Price"]=Final_df["Price"].str.replace("INR","")
Final_df["Price"]=Final_df["Price"].astype(float)
Final_df["Price"].fillna(0)

0       750.0
1       900.0
2       693.0
3       900.0
4       924.0
        ...
2212    167.0
2213    145.0
2214    121.0
2215    111.0
2216    111.0
Name: Price, Length: 2217, dtype: float64

In [11]:
# Convert the Ratings column to string first to avoid the AttributeError
Final_df["Ratings"] = Final_df["Ratings"].astype(str)

# Replace "New" with an empty string and strip whitespaces
Final_df["Ratings"] = Final_df["Ratings"].str.replace("New", "", regex=False).str.strip()

# Handle missing or empty values before splitting
Final_df["Ratings"] = Final_df["Ratings"].fillna("").str.split().str[0]

# Convert to numeric, with errors coerced to NaN
Final_df["Ratings"] = pd.to_numeric(Final_df["Ratings"], errors='coerce')

# Fill NaN

In [13]:
# info after the data type change
Final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2217 entries, 0 to 2216
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         2082 non-null   object
 1   Bus_type         2057 non-null   object
 2   Start_time       2082 non-null   object
 3   End_time         2082 non-null   object
 4   Total_duration   2082 non-null   object
 5   Price            2079 non-null   float64
 6   Seats_Available  2075 non-null   object
 7   Ratings          2052 non-null   float64
 8   Route_link       2217 non-null   object
 9   Route_name       2217 non-null   object
dtypes: float64(2), object(8)
memory usage: 173.3+ KB

In [16]:
missing_seats =  Final_df [Final_df["Seats_Available"].isnull()]
print(missing_seats)

     Bus_name Bus_type Start_time End_time Total_duration  Price  \
473       NaN      NaN        NaN      NaN            NaN    NaN
474       NaN      NaN        NaN      NaN            NaN    NaN
475       NaN      NaN        NaN      NaN            NaN    NaN
476       NaN      NaN        NaN      NaN            NaN    NaN
477       NaN      NaN        NaN      NaN            NaN    NaN
...       ...      ...        ...      ...            ...    ...
1654      NaN      NaN        NaN      NaN            NaN    NaN
1687      NaN      NaN        NaN      NaN            NaN    NaN
1710      NaN      NaN        NaN      NaN            NaN    NaN
2200      NaN      NaN        NaN      NaN            NaN    NaN
2211      NaN      NaN        NaN      NaN            NaN    NaN

     Seats_Available  Ratings  \
473              NaN      NaN
474              NaN      NaN
475              NaN      NaN
476              NaN      NaN
477              NaN      NaN
...              ...      ...
1654             NaN      NaN
1687             NaN      NaN
1710             NaN      NaN
2200             NaN      NaN
2211             NaN      NaN

                                             Route_link  \
473   https://www.redbus.in/bus-tickets/bangalore-to...
474   https://www.redbus.in/bus-tickets/bangalore-to...
475   https://www.redbus.in/bus-tickets/bangalore-to...
476   https://www.redbus.in/bus-tickets/bangalore-to...
477   https://www.redbus.in/bus-tickets/bangalore-to...
...                                                 ...
1654  https://www.redbus.in/bus-tickets/kolkata-to-n...
1687  https://www.redbus.in/bus-tickets/digha-to-bar...
1710  https://www.redbus.in/bus-tickets/kolkata-to-r...
2200  https://www.redbus.in/bus-tickets/kolkata-to-d...
2211  https://www.redbus.in/bus-tickets/kolkata-to-a...

                               Route_name
473              Bangalore to Madanapalli
474              Bangalore to Madanapalli
475              Bangalore to Madanapalli
476              Bangalore to Madanapalli
477              Bangalore to Madanapalli
...                                   ...
1654  Kolkata to Nandakumar (west bengal)
1687       Digha to Barasat (West Bengal)
1710    Kolkata to Ramnagar (West Bengal)
2200    Kolkata to Durgapur (West Bengal)
2211     Kolkata to Asansol (West Bengal)

[142 rows x 10 columns]

In [15]:
Final_df.dropna(subset=['Seats_Available'], inplace=True)  # Remove rows with NaN in Start_time

In [43]:
# Filter out rows with null values in 'Bus_type'
Final_df = Final_df.dropna(subset=['Bus_type'])

In [17]:
Final_df = Final_df[Final_df["Price"] <= 7000]

In [19]:
# replacing the nan value
Final_df = Final_df.replace({np.nan: None})

In [21]:
# change dataframe to csv
path=r"C:\Users\HP\Desktop\red bus\Final_busdetails_df.csv"
Final_df.to_csv(path,index=False)

In [ ]:
CREATE A MYSQL DATABASE

In [27]:
mydb = mysql.connector.connect(
  host="localhost",
  user="diddha",
  password="diddha#300396",
  #database='joins'
  
)

In [29]:
print(mydb)
mycursor = mydb.cursor(buffered=True)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002C13F530440>

In [31]:
mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

('information_schema',)
('mysql',)
('performance_schema',)
('red_bus_details',)
('sys',)

In [33]:
mycursor.execute("CREATE DATABASE IF NOT EXISTS RED_BUS_DETAILS")

In [35]:
mycursor.execute("USE RED_BUS_DETAILS")

In [37]:
# Table Creation
mycursor.execute('''CREATE TABLE IF NOT EXISTS bus_details(
                  ID INT AUTO_INCREMENT PRIMARY KEY,
                  Bus_name VARCHAR(255) NOT NULL,
                  Bus_type VARCHAR(255) NOT NULL,
                  Start_time VARCHAR(255) NOT NULL,
                  End_time VARCHAR(255) NOT NULL,
                  Total_duration VARCHAR(255) NOT NULL,
                  Price FLOAT NULL,
                  Seats_Available VARCHAR(255) NOT NULL,
                  Ratings Float NULL,
                  Route_link VARCHAR(255) NULL,
                  Route_name VARCHAR(255) NULL
                  )''')
print("Table Created successfully")

Table Created successfully

In [45]:
insert_query = '''INSERT INTO bus_details
(
    Bus_name,
    Bus_type,
    Start_time,
    End_time,
    Total_duration,
    Price,
    Seats_Available,
    Ratings,
    Route_link,
    Route_name
)
VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)'''

data = Final_df.values.tolist()

mycursor.executemany(insert_query, data)

mydb.commit()

print("Values inserted successfully")

Values inserted successfully